---
title: FilteredElementIterator
classe: Autodesk.Revit.DB.FilteredElementIterator
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# FilteredElementIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Element Current { get; }` | `filteredElementIterator.Current` | Element |
| `Boolean IsValidObject { get; }` | `filteredElementIterator.IsValidObject` | Boolean |
| `Void Dispose()` | `filteredElementIterator.Dispose()` | Void |
| `Element GetCurrent()` | `filteredElementIterator.GetCurrent()` | Element |
| `Boolean IsDone()` | `filteredElementIterator.IsDone()` | Boolean |
| `Boolean MoveNext()` | `filteredElementIterator.MoveNext()` | Boolean |
| `Void Reset()` | `filteredElementIterator.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```